First, import the libraries that we will be using in this tutorial and check the versions.

In [1]:
%matplotlib inline
import sys
import pandas as pd
import numpy as np
import matplotlib as matplt
import matplotlib.pyplot as plt

print('Python version ' + sys.version)
print('Numpy version ' + np.__version__)
print('Pandas version ' + pd.__version__)
print('Matplotlib version ' + matplt.__version__)

Python version 3.6.0 |Anaconda 4.3.1 (x86_64)| (default, Dec 23 2016, 13:19:00)
[GCC 4.2.1 Compatible Apple LLVM 6.0 (clang-600.0.57)]
Numpy version 1.11.3
Pandas version 0.19.2
Matplotlib version 2.0.0

Create a dataframe from a toy dataset and it df

In [2]:
data = {'name': ['Mr. Jason', 'Molly', 'Ms. Tina', 'Jake', 'Amy'], 
        'age': [42, 52, 36, 24, 52],
        'sex':['M','F','M','F','F'],
        'preTestScore': [4, 50, 200, 0, 10],
        'postTestScore': [55, 64, 77, 92, 70],
        'date':['9-1-2016', '9-2-2016', '9-3-2016','9-4-2016','9-5-2016'],
        }
df = pd.DataFrame(data, columns = ['name', 'sex', 'age', 'preTestScore', 'postTestScore','date'])
df

        name sex  age  preTestScore  postTestScore      date
0  Mr. Jason   M   42             4             55  9-1-2016
1      Molly   F   52            50             64  9-2-2016
2   Ms. Tina   M   36           200             77  9-3-2016
3       Jake   F   24             0             92  9-4-2016
4        Amy   F   52            10             70  9-5-2016

3- General information about the dataframe

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
name             5 non-null object
sex              5 non-null object
age              5 non-null int64
preTestScore     5 non-null int64
postTestScore    5 non-null int64
date             5 non-null object
dtypes: int64(3), object(3)
memory usage: 320.0+ bytes

4- Some statistic about the dataframe

In [4]:
df.describe()

             age  preTestScore  postTestScore
count   5.000000      5.000000       5.000000
mean   41.200000     52.800000      71.600000
std    11.798305     84.671128      13.974978
min    24.000000      0.000000      55.000000
25%    36.000000      4.000000      64.000000
50%    42.000000     10.000000      70.000000
75%    52.000000     50.000000      77.000000
max    52.000000    200.000000      92.000000

5- Select a column

In [5]:
df['age']

0    42
1    52
2    36
3    24
4    52
Name: age, dtype: int64

In [6]:
df[['age']]

   age
0   42
1   52
2   36
3   24
4   52

6- Select multiple columns

In [7]:
df[['name', 'age', 'sex']]

        name  age sex
0  Mr. Jason   42   M
1      Molly   52   F
2   Ms. Tina   36   M
3       Jake   24   F
4        Amy   52   F

7- Select a row

In [8]:
#select certain rows 
df.take([0, 3])

        name sex  age  preTestScore  postTestScore      date
0  Mr. Jason   M   42             4             55  9-1-2016
3       Jake   F   24             0             92  9-4-2016

In [9]:
df.loc[0]

name             Mr. Jason
sex                      M
age                     42
preTestScore             4
postTestScore           55
date              9-1-2016
Name: 0, dtype: object

In [10]:
df.iloc[0]

name             Mr. Jason
sex                      M
age                     42
preTestScore             4
postTestScore           55
date              9-1-2016
Name: 0, dtype: object

-Change the index

In [11]:
df['age'].mean() , df.age.mean()

(41.2, 41.2)

In [12]:
df.query('preTestScore > postTestScore')

       name sex  age  preTestScore  postTestScore      date
2  Ms. Tina   M   36           200             77  9-3-2016